// ITSA.cpp : 此檔案包含 'main' 函式。程式會於該處開始執行及結束執行。
//
//第一題 矩陣數字顯示

#include <iostream>
using namespace std;

const int row=5;
//const string num_display[5][10]{
//    {"＊＊＊＊＊","　　　　＊","＊＊＊＊＊","＊＊＊＊＊","＊　　　＊","＊＊＊＊＊","＊＊＊＊＊","＊＊＊＊＊","＊＊＊＊＊","＊＊＊＊＊"},
//    {"＊　　　＊","　　　　＊","　　　　＊","　　　　＊","＊　　　＊","＊　　　　","＊　　　　","　　　　＊","＊　　　＊","＊　　　＊"},
//    {"＊　　　＊","　　　　＊","＊＊＊＊＊","＊＊＊＊＊","＊＊＊＊＊","＊＊＊＊＊","＊＊＊＊＊","　　　　＊","＊＊＊＊＊","＊＊＊＊＊"},
//    {"＊　　　＊","　　　　＊","＊　　　　","　　　　＊","　　　　＊","　　　　＊","＊　　　＊","　　　　＊","＊　　　＊","　　　　＊"},
//    {"＊＊＊＊＊","　　　　＊","＊＊＊＊＊","＊＊＊＊＊","　　　　＊","＊＊＊＊＊","＊＊＊＊＊","　　　　＊","＊＊＊＊＊","　　　　＊"},
//};
const string num_display[5][10]{
    {"*****","    *","*****","*****","*   *","*****","*****","*****","*****","*****"},
    {"*   *","    *","    *","    *","*   *","*    ","*    ","    *","*   *","*   *"},
    {"*   *","    *","*****","*****","*****","*****","*****","    *","*****","*****"},
    {"*   *","    *","*    ","    *","    *","    *","*   *","    *","*   *","    *"},
    {"*****","    *","*****","*****","    *","*****","*****","    *","*****","    *"},
};

int main()
{
    string num;
    int col[4];
    //cout << "請輸入數值 : ";
    cin >> num;
     for(int i=0;i<4;i++)
        switch (num[i]) {
        case '0':
            col[i] = 0;
            break;
        case '1':
            col[i] = 1;
            break;
        case '2':
            col[i] = 2;
            break;
        case '3':
            col[i] = 3;
            break;
        case '4':
            col[i] = 4;
            break;
        case '5':
            col[i] = 5;
            break;
        case '6':
            col[i] = 6;
            break;
        case '7':
            col[i] = 7;
            break;
        case '8':
            col[i] = 8;
            break;
        case '9':
            col[i] = 9;
            break;
        default:
            cout << "請不要亂輸入";
            break;
        }

    for (int i = 0; i < row; i++) {
        for (int j = 0; j < 4; j++) {
            cout << num_display[i][col[j]];
            if (j < 3) cout << ' ';
        }
        cout << endl;
    }

}

// 執行程式: Ctrl + F5 或 [偵錯] > [啟動但不偵錯] 功能表
// 偵錯程式: F5 或 [偵錯] > [啟動偵錯] 功能表

// 開始使用的提示: 
//   1. 使用 [方案總管] 視窗，新增/管理檔案
//   2. 使用 [Team Explorer] 視窗，連線到原始檔控制
//   3. 使用 [輸出] 視窗，參閱組建輸出與其他訊息
//   4. 使用 [錯誤清單] 視窗，檢視錯誤
//   5. 前往 [專案] > [新增項目]，建立新的程式碼檔案，或是前往 [專案] > [新增現有項目]，將現有程式碼檔案新增至專案
//   6. 之後要再次開啟此專案時，請前往 [檔案] > [開啟] > [專案]，然後選取 .sln 檔案
